# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\info\Desktop\Spring 2019 Classes\6.115\6.115-final\PSoCCreator\Final Project\FinalEmulator.cydsn\FinalEmulator.cyprj
# Date: Mon, 29 Apr 2019 21:50:13 GMT
#set_units -time ns
create_clock -name {clk_timer(routed)} -period 16666666.666666666 -waveform {0 8333333.33333333} [list [get_pins {ClockBlock/dclk_0}]]
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {clk_timer} -source [get_pins {ClockBlock/clk_sync}] -edges {1 400001 800001} [list [get_pins {ClockBlock/dclk_glb_0}]]


# Component constraints for C:\Users\info\Desktop\Spring 2019 Classes\6.115\6.115-final\PSoCCreator\Final Project\FinalEmulator.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\info\Desktop\Spring 2019 Classes\6.115\6.115-final\PSoCCreator\Final Project\FinalEmulator.cydsn\FinalEmulator.cyprj
# Date: Mon, 29 Apr 2019 21:50:10 GMT
